configuration/src/DataProcessors/AvailableQuestionnaires/AvailableQuestionnaires.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AvailableQuestionnaires</name>
  <attributes>
    <name>Respondent</name>
    <type>
      <types>DefinedType.Respondent</types>
    </type>
  </attributes>
  <attributes>
    <name>SurveyMode</name>
    <type>
      <types>EnumRef.SurveyModes</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

configuration/src/Enums/SurveyModes/SurveyModes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SurveyModes</name>
  <enumValues>
    <name>Questionnaire</name>
  </enumValues>
  <enumValues>
    <name>Interview</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Questionnaire/Questionnaire.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Questionnaire</name>
  <registerRecords>InformationRegister.QuestionnaireQuestionAnswers</registerRecords>
  <attributes>
    <name>Survey</name>
    <type>
      <types>DocumentRef.PollPurpose</types>
    </type>
  </attributes>
  <attributes>
    <name>Respondent</name>
    <type>
      <types>DefinedType.Respondent</types>
    </type>
  </attributes>
  <attributes>
    <name>EditDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SectionToEdit</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplateQuestions</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Interviewer</name>
    <type>
      <types>DefinedType.Interviewer</types>
    </type>
  </attributes>
  <attributes>
    <name>QuestionnaireTemplate</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>SurveyMode</name>
    <type>
      <types>EnumRef.SurveyModes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Content</name>
    <attributes>
      <name>DoQueryBox</name>
      <type>
        <types>CatalogRef.QuestionnaireTemplateQuestions</types>
      </type>
    </attributes>
    <attributes>
      <name>ElementaryQuestion</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
      </type>
    </attributes>
    <attributes>
      <name>CellNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Response</name>
      <type>
        <types>Characteristic.QuestionsForSurvey</types>
      </type>
    </attributes>
    <attributes>
      <name>OpenAnswer</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>IsUnanswered</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/DataProcessors/AvailableQuestionnaires/Forms/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Object.SurveyMode = Enums.SurveyModes.Questionnaire;
	If Parameters.Property("SurveyMode") Then
		Object.SurveyMode = Parameters.SurveyMode;
		Object.Respondent = Parameters.Respondent;
	Else
		CurrentUser = Users.AuthorizedUser();
		If TypeOf(CurrentUser) <> Type("CatalogRef.ExternalUsers") Then 
			Object.Respondent = CurrentUser;
		Else	
			Object.Respondent = ExternalUsers.GetExternalUserAuthorizationObject(CurrentUser);
		EndIf;
	EndIf;
	
	RespondentQuestionnairesTable();
	 
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "Write_Questionnaire" Or EventName = "PostingQuestionnaire" Then
		RespondentQuestionnairesTable();
	EndIf;
	
EndProcedure 

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure QuestionnairesTreeBeforeChange(Item, Cancel)
	
	Cancel = True;
	
	CurrentData = Items.QuestionnairesTable.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	If TypeOf(CurrentData.QuestionnaireSurvey) = Type("DocumentRef.Questionnaire") Then
		ParametersStructure = New Structure;
		ParametersStructure.Insert("Key",CurrentData.QuestionnaireSurvey);
		ParametersStructure.Insert("FillingFormOnly", True);
		ParametersStructure.Insert("SurveyMode", Object.SurveyMode);
		ParametersStructure.Insert("Title", CurrentData.Presentation);
		OpenForm("Document.Questionnaire.ObjectForm", ParametersStructure, Item);
	ElsIf TypeOf(CurrentData.QuestionnaireSurvey) = Type("DocumentRef.PollPurpose") Then
		ParametersStructure = New Structure;
		FillingValues 	= New Structure;
		FillingValues.Insert("Respondent", Object.Respondent);
		FillingValues.Insert("Survey", CurrentData.QuestionnaireSurvey);
		FillingValues.Insert("SurveyMode", Object.SurveyMode);
		ParametersStructure.Insert("Title", CurrentData.Presentation);
		ParametersStructure.Insert("FillingValues", FillingValues);
		ParametersStructure.Insert("FillingFormOnly", True);
		OpenForm("Document.Questionnaire.ObjectForm", ParametersStructure, Item, CurrentData.Presentation);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure ArchivedQuestionnaires(Command)
	
	OpenForm("DataProcessor.AvailableQuestionnaires.Form.ArchivedQuestionnaires",New Structure("Respondent",Object.Respondent),ThisObject);
	
EndProcedure 

&AtClient
Procedure Refresh(Command)
	
	RespondentQuestionnairesTable();
	
EndProcedure 

#EndRegion

#Region Private

&AtServer
Procedure RespondentQuestionnairesTable()
	
	QuestionnairesTable.Clear();
	
	ReceivedQuestionnairesTable = Surveys.TableOfQuestionnairesAvailableToRespondent(Object.Respondent);
	
	If ReceivedQuestionnairesTable <> Undefined Then
		
		For Each TableRow In ReceivedQuestionnairesTable Do
			
			NewRow = QuestionnairesTable.Add();
			If Not ValueIsFilled(TableRow.QuestionnaireSurvey) Then
				
				NewRow.Presentation = TableRow.Status;
				NewRow.Status        = TableRow.Status;
				
			Else
				
				NewRow.Status        = TableRow.Status;
				NewRow.QuestionnaireSurvey   = TableRow.QuestionnaireSurvey;
				NewRow.Presentation = GetQuestionnaireTreeRowsPresentation(TableRow);
				
			EndIf;
			
			NewRow.PictureCode = ?(TableRow.Status = "Surveys",0,1);
			
		EndDo;
		
	EndIf;
	
EndProcedure

// Generates a row presentation for the questionnaires tree.
//
// Parameters:
//  TreeRow  - ValueTreeRow - based on it, a presentation of questionnaires 
//                 and surveys in the tree is generated.
//
&AtServer
Function GetQuestionnaireTreeRowsPresentation(TreeRow)
	
	If TypeOf(TreeRow.QuestionnaireSurvey) = Type("DocumentRef.PollPurpose") Then
		If ValueIsFilled(TreeRow.EndDate) Then
			Return StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = '""%1"" must be filled out by %2';"),
				TreeRow.Description, Format(BegOfDay(EndOfDay(TreeRow.EndDate) + 1), "DLF=D"));
		Else	
			Return StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = '""%1""';"), TreeRow.Description);
		EndIf;
	ElsIf TypeOf(TreeRow.QuestionnaireSurvey) = Type("DocumentRef.Questionnaire") Then
		If ValueIsFilled(TreeRow.QuestionnaireDate) And ValueIsFilled(TreeRow.EndDate) Then
			Return StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = '""%1"" was last edited on %2 and must be filled out by %3';"), 
				TreeRow.Description, Format(TreeRow.QuestionnaireDate, "DLF=D"),
				Format(BegOfDay(EndOfDay(TreeRow.EndDate) + 1), "DLF=D"));
		ElsIf ValueIsFilled(TreeRow.QuestionnaireDate) Then
			Return StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = '""%1"" was last edited on %2';"), 
				TreeRow.Description, Format(TreeRow.QuestionnaireDate, "DLF=D"));
		Else
			Return StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = '""%1""';"), TreeRow.Description);
		EndIf;
	EndIf;
	Return "";
	
EndFunction

#EndRegion
